#len = 문자 길이열을 세는 함수
snack='꿀꽈배기'
print(len(snack)) #4가 나옴


#''', """ << 여러줄 문자열
print("""아아
아아아
아아아""")

print('''아아아
아아아아
아아아아아''')

#'?'*10 << 반복표현
print('-'*100)

#문자열의 메소드(문자열 뒤에 붙는 부가기능역할)

#.lower() << 모든 문자열을 소문자로
#.upper() << 모든 문자열을 대문자로
#.capitalize() << 첫 글자만 대문자로
#.title() << 각 단어의 첫글자만 대문자로
#.swapcase() << 문자열의 대소문자를 뒤바꿈
#.split() << 각 문자열을 자름 (스페이스바, 엔터 순)
#count(?) << 각 문자열이 몇번 나왔는지 세는애
#startswith(?) << 시작 문자열 맞는지? T or F
#endswith(?) << 끝 문자열 맞는지? T or F
#strio(?) << 지정 문자까지 자르고 표시함 .?-아아-?. >> -아아-
